config/cf/Enums/ПериодыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПериодыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Январь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Февраль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Март</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Апрель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Май</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Июнь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Июль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Август</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сентябрь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Октябрь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ноябрь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декабрь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервыйКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВторойКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретийКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетвертыйКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтотГод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидПериодаПервичногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидПериодаПервичногоДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ПериодыПервичныхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мПериоды		= Перечисления.ПериодыПервичныхДокументов;
	мВидПериода		= Неопределено;
	Если Параметры.Отбор.Свойство("ВидПериода", мВидПериода) Тогда
		Если мВидПериода = Перечисления.ВидПериодаПервичногоДокумента.Месяц Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мПериоды.Январь);
			ДанныеВыбора.Добавить(мПериоды.Февраль);
			ДанныеВыбора.Добавить(мПериоды.Март);
			ДанныеВыбора.Добавить(мПериоды.Апрель);
			ДанныеВыбора.Добавить(мПериоды.Май);
			ДанныеВыбора.Добавить(мПериоды.Июнь);
			ДанныеВыбора.Добавить(мПериоды.Июль);
			ДанныеВыбора.Добавить(мПериоды.Август);
			ДанныеВыбора.Добавить(мПериоды.Сентябрь);
			ДанныеВыбора.Добавить(мПериоды.Октябрь);
			ДанныеВыбора.Добавить(мПериоды.Ноябрь);
			ДанныеВыбора.Добавить(мПериоды.Декабрь);
			
		ИначеЕсли мВидПериода = Перечисления.ВидПериодаПервичногоДокумента.Квартал Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(мПериоды.ПервыйКвартал);
			ДанныеВыбора.Добавить(мПериоды.ВторойКвартал);
			ДанныеВыбора.Добавить(мПериоды.ТретийКвартал);
			ДанныеВыбора.Добавить(мПериоды.ЧетвертыйКвартал);
			
		Иначе			
			ДанныеВыбора = Новый СписокЗначений;			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
